trade/src/Reports/ВедомостьПоРетроБонусамПоставщиков/ВедомостьПоРетроБонусамПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ВедомостьПоРетроБонусамПоставщиков</name>
</mdclass:Report>

trade/src/Documents/АктПремииПоставщика/АктПремииПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПремииПоставщика</name>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>InformationRegister.СуммыДокументовВВалютахУчета</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоПрочимАктивамПассивам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоСрокам</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияКонтрагентДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.РетроБонусыПоставщиков</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСчетовУчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовПассивов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходов</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РетроБонусы</name>
    <attributes>
      <name>ДокументУсловий</name>
      <type>
        <types>DocumentRef.УсловияРетроБонусовПоставщика</types>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонуса</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаБонуса</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>КурсЧислительВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсЗнаменательВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <comment>Наименование в латинской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнаяИнформацияФНС</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияФНС</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновленияДанныхФНС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выручка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРаботников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаЭДО</name>
    <type>
      <types>EnumRef.УдалитьСистемаЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВТранскрипции</name>
    <comment>Наименование в русской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>550</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СокращенноеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade/src/Reports/ВедомостьПоРетроБонусамПоставщиков/ObjectModule.bsl
//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	
	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	
	УказанПериод = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОсновнойСхемы, "Период").Использование;
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОсновнойСхемы, "УказанПериод", УказанПериод, УказанПериод);
	
	КомментарийЗавершено = НСтр("ru = 'Расчеты по условию закрыты, расхождение на конец периода не рассчитывается'");
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
		НастройкиОсновнойСхемы,
		"КомментарийЗавершено",
		КомментарийЗавершено);
	
	КомментарийПустоеУсловие = НСтр("ru = 'Акты без условий, расхождения не рассчитываются'");
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
		НастройкиОсновнойСхемы,
		"КомментарийПустоеУсловие",
		КомментарийПустоеУсловие);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОсновнойСхемы, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки, Истина);
	
	ПроцессорВыводаВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаВТабличныйДокумент.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
	
	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить(
			"ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;
	
	ОтчетПустой = ОтчетыСервер.ОтчетПустой(ЭтотОбъект, ПроцессорКомпоновкиДанных);
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ОтчетПустой", ОтчетПустой);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения, Неопределено - Форма отчета или форма настроек отчета.
//       Неопределено когда вызов без контекста.
//   КлючВарианта - Строка, Неопределено - Имя предопределенного
//       или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов без контекста.
//   Настройки - См. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт 
	
	Если КлючВарианта = "ВедомостьПоРетроБонусамПоставщиковКонтекст" Тогда
		
		Настройки.ФормироватьСразу = Истина;
		Настройки.РазрешеноИзменятьВарианты = Ложь;
		
	КонецЕсли;
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	Настройки.События.ПриОпределенииСвойствЭлементовФормыНастроек = Истина;
	Настройки.События.ПередФормированиемОтчета = Истина;
	
КонецПроцедуры

// См. ОтчетыПереопределяемый.ПриСозданииНаСервере
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ВыводитьКомментарийВШапке = Истина;
	Параметры = Форма.Параметры;
	
	Если Параметры.Свойство("ПараметрКоманды") Тогда
		
		Если ТипЗнч(Параметры.ПараметрКоманды) = Тип("ДокументСсылка.УсловияРетроБонусовПоставщика") Тогда
			
			ВыводитьКомментарийВШапке = Ложь;
			УсловияРетроБонусовПоставщика = Параметры.ПараметрКоманды; // ДокументСсылка.УсловияРетроБонусовПоставщика
			
			Реквизиты = "Исправление, ИсправляемыйДокумент";
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УсловияРетроБонусовПоставщика, Реквизиты);
			
			Если ЗначенияРеквизитов.Исправление = Истина Тогда
				ИсходныйДокумент = ЗначенияРеквизитов.ИсправляемыйДокумент;
			Иначе
				ИсходныйДокумент = УсловияРетроБонусовПоставщика;
			КонецЕсли;
			
			Форма.ФормаПараметры.Отбор = Новый Структура("ДокументУсловий", ИсходныйДокумент);
			Форма.НастройкиОтчета.РазрешеноВыбиратьВарианты = Ложь;
			
		ИначеЕсли ТипЗнч(Параметры.ПараметрКоманды) = Тип("ДокументСсылка.АктПремииПоставщика") Тогда
			
			АктПремииПоставщика = Параметры.ПараметрКоманды; // ДокументСсылка.АктПремииПоставщика
			УстановитьОтборыПоАкту(Форма, АктПремииПоставщика);
			ДобавляемыеРеквизитыФормы = Новый Массив(); // Массив из РеквизитФормы
			
			ТипРеквизита = Новый ОписаниеТипов("ДокументСсылка.АктПремииПоставщика");
			ИмяРеквизита = "АктПремииПоставщика";
			
			НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, ТипРеквизита);
			ДобавляемыеРеквизитыФормы.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(ДобавляемыеРеквизитыФормы);
			
			ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, ИмяРеквизита, АктПремииПоставщика);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыводитьКомментарийВШапке Тогда
		
		ДобавляемыеРеквизитыФормы = Новый Массив(); // Массив из РеквизитФормы
		
		ТипСтрока = Новый ОписаниеТипов("Строка");
		ИмяРеквизита = "КомментарийВШапке";
		
		РеквизитКомментарийВШапке = Новый РеквизитФормы(ИмяРеквизита, ТипСтрока);
		ДобавляемыеРеквизитыФормы.Добавить(РеквизитКомментарийВШапке);
		
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизитыФормы);
		КомментарийВШапке = СтрокаРасчетыАктуальны();
		
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, ИмяРеквизита, КомментарийВШапке);
		
		Элементы = Форма.Элементы;
		
		Если Элементы.Найти("КомандыИПоказатели") <> Неопределено Тогда
			НовыйЭлемент = Элементы.Вставить(ИмяРеквизита, Тип("ПолеФормы"),, Элементы.КомандыИПоказатели);
		Иначе
			НовыйЭлемент = Элементы.Вставить(ИмяРеквизита, Тип("ПолеФормы"));
		КонецЕсли;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.ПутьКДанным = ИмяРеквизита;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается после определения свойств элементов формы, связанных с пользовательскими настройками.
// См. ОтчетыСервер.СвойстваЭлементовФормыНастроек()
// Позволяет переопределить свойства, для целей персонализации отчета.
//
// Параметры:
//  ТипФормы - ТипФормыОтчета - см. Синтакс-помощник
//  СвойстваЭлементов - см. ОтчетыСервер.СвойстваЭлементовФормыНастроек
//  ПользовательскиеНастройки - КоллекцияЭлементовПользовательскихНастроекКомпоновкиДанных - элементы актуальных
//                              пользовательских настроек, влияющих на создание связанных элементов формы.
//
Процедура ПриОпределенииСвойствЭлементовФормыНастроек(ТипФормы, СвойстваЭлементов, ПользовательскиеНастройки) Экспорт
	
	Если ТипФормы <> ТипФормыОтчета.Основная Тогда 
		Возврат;
	КонецЕсли;
	
	ПолеКомпоновкиДанных = Новый ПолеКомпоновкиДанных("Партнер");
	
	ТаблицаПолей = СвойстваЭлементов.Поля;
	ТаблицаПолей.Колонки.Добавить("ПараметрыВыбора", Новый ОписаниеТипов("ФиксированныйМассив"));
	
	Для Каждого СвойстваПоля Из ТаблицаПолей Цикл
		
		Если ТипЗнч(СвойстваПоля.ОписаниеНастройки) = Тип("ДоступноеПолеОтбораКомпоновкиДанных")
		   И СвойстваПоля.ОписаниеНастройки.Поле = ПолеКомпоновкиДанных Тогда
			
			ПараметрыВыбора = Новый Массив; // Массив из ПараметрВыбора
			Параметр = Новый ПараметрВыбора("Отбор.Поставщик", Истина); 
			ПараметрыВыбора.Добавить(Параметр);
			
			СвойстваПоля.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  ФормаОтчета - ФормаКлиентскогоПриложения
//  ДополнительныеПараметры - Структура:
//   * ТекстПредупреждения - Строка
//   * ИмяПараметраХраненияОтказаОтПредупреждения - Строка
//
Процедура ПередФормированиемОтчета(ФормаОтчета, ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаОтчета, "КомментарийВШапке") Тогда
		
		КомментарийВШапке = СтрокаРасчетыАктуальны();
		
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(
			ФормаОтчета, "КомментарийВШапке", КомментарийВШапке);
		
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаОтчета, "АктПремииПоставщика") Тогда
		
		АктПремииПоставщика = ФормаОтчета.АктПремииПоставщика; // ДокументСсылка.АктПремииПоставщика
		УстановитьОтборыПоАкту(ФормаОтчета, АктПремииПоставщика);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтрокаРасчетыАктуальны()
	
	СтрокаПодсказки = НСтр("ru = 'Данные статусов расчетов по документам ""Условия ретро-бонусов поставщиков"" актуальны'");
	
	Возврат СтрокаПодсказки;
	
КонецФункции

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  АктПремииПоставщика - ДокументСсылка.АктПремииПоставщика
//
Процедура УстановитьОтборыПоАкту(Форма, АктПремииПоставщика)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	Отбор.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	
	ДанныеДляОтбора = ДанныеАкта(АктПремииПоставщика);
	ДанныеШапки = ДанныеДляОтбора.ДанныеШапки;
	ДокументыУсловий = ДанныеДляОтбора.ДокументыУсловий;
	
	ДокументыУсловийСписок = Новый СписокЗначений;
	ДокументыУсловийСписок.ЗагрузитьЗначения(ДокументыУсловий);
	Если ДанныеШапки.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(Отбор, ДанныеШапки);
		
	КонецЕсли;
	Отбор.Вставить("ДокументУсловий", ДокументыУсловийСписок);
	
	Форма.ФормаПараметры.Отбор = Отбор;
	Форма.НастройкиОтчета.РазрешеноВыбиратьВарианты = Ложь;
	
	НовыеНастройки = КомпоновщикНастроек.ПолучитьНастройки();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		НовыеНастройки.Отбор,
		"Контрагент",
		Отбор.Контрагент,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		НовыеНастройки.Отбор,
		"Организация",
		Отбор.Организация,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		НовыеНастройки.Отбор,
		"ДокументУсловий",
		ДокументыУсловийСписок,
		ВидСравненияКомпоновкиДанных.ВСписке,
		,
		Истина);
		
	КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
	
КонецПроцедуры

// Данные акта.
// 
// Параметры:
//  АктПремииПоставщика - ДокументСсылка.АктПремииПоставщика - 
// 
// Возвращаемое значение:
//  Структура - Данные акта:
// * ДанныеШапки - ВыборкаИзРезультатаЗапроса:
//   ** Организация - СправочникСсылка.Организации
//   ** Контрагент - СправочникСсылка.Контрагенты
// * ДокументыУсловий - Массив Из ДокументСсылка.УсловияРетроБонусовПоставщика
// 
Функция ДанныеАкта(АктПремииПоставщика)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", АктПремииПоставщика);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктПремииПоставщика.Организация КАК Организация,
	|	АктПремииПоставщика.Контрагент КАК Контрагент
	|ИЗ
	|	Документ.АктПремииПоставщика КАК АктПремииПоставщика
	|ГДЕ
	|	АктПремииПоставщика.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктПремииПоставщикаРетроБонусы.ДокументУсловий КАК ДокументУсловий
	|ИЗ
	|	Документ.АктПремииПоставщика.РетроБонусы КАК АктПремииПоставщикаРетроБонусы
	|ГДЕ
	|	АктПремииПоставщикаРетроБонусы.Ссылка = &Ссылка";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = Результат[0].Выбрать();
	ДокументыУсловий = Результат[1].Выгрузить().ВыгрузитьКолонку("ДокументУсловий");
	
	Данные = Новый Структура;
	Данные.Вставить("ДанныеШапки", ДанныеШапки);
	Данные.Вставить("ДокументыУсловий", ДокументыУсловий);
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#КонецЕсли
